# Pseudocódigo


> Para os dados individuais
1. Fazer a conexão com o Big Query
2. Extrair os dados históricos desejados no bigquery
3. Extrair os dados atuais desejados
4. Fazer ajustes e padronizações nos dados
5. Inserir os dados atuais na base histórica (considerando apenas o que for novo)
6. Subir a nova tabela para o Big Query
7. Conectar o Power BI ao Big Query para realização das análises
8. Tornar esse processo automático para ser executado todos os dias as 12h (PythonAnywhere)

> Para o modelo de machine learning
1. [Stand by] Criar um Dataframe que armazene os dados MENSAIS de todas os indicadores monitorados
2. [Stand by] Aplicar um modelo de regressão linear para prever o custo mensal da matéria prima de Suíno, tendo como base os demais dados. 
3. [Stand by] Aplicar esse modelo diariamente no momento da atualização.
4. [Stand by] Criar uma tabela com os dados históricos + a previsão.
5. [Stand by] Subir essa tabela para o Big Query
6. [Stand by] Conectar o Power BI ao Power Query para realizar a análise

# Configurações de conexão com Google Big Query

In [5]:
import pandas_gbq #Conexão com o Bigquery pelo Pandas
import pandas as pd # Pacote pandas tradicional
from google.oauth2 import service_account #Conexão com Google Cloud

In [6]:
COPES = [
    'https://www.googleapis.com/auth/cloud-platform'
]

credentials = service_account.Credentials.from_service_account_info(
{
  "type": "service_account",
  "project_id": "fluent-observer-386614",
  "private_key_id": "703d3971feebde4a37856ddbca01106ed0eac93b",
  "private_key": "-----BEGIN PRIVATE KEY-----\nMIIEvgIBADANBgkqhkiG9w0BAQEFAASCBKgwggSkAgEAAoIBAQDSMW1xC4/jdZQj\nYLXibclUpYuLukPwjkzgJeNr26UtpFtSRtX5YIH1sv0wqb+SniztcIaG/fZs3ipn\nY1tVqV4R9mOvwjAQ1t0EDjMhy8XFMbU2C4i1yxjFpMShgQkk8nOAOnT4fjyrFFi2\n2EfBGHdodLqUBnKcshE4Cak4s2QCYISs55k6R2WYSrriPF5IGxScZgBiE993Trv2\nFI20rxhuu2DpTDmJug5bnVN9X2p377nUYnaDDLNvphZYeloYPOMKwKYATkhY8o9U\nnYT9n4omFgPj2GfQghLAiwyssVvnwacZ3grG/yHdtpTwmKwBgfeXEWdWufKPNXBx\nGnvf+7ZNAgMBAAECggEANCRJy2S8XYch6ALKK/DjJEnqy4854ldSj7omZ++1UpS2\niLsEwpejtZEgyO0bFmKBr6cd4Cfo9QnJyBr4IdBhgyA1i3inFs5ORn7FRWl41pml\no9IJqFtI+mKM2qmZXJ5+c31M3gXmw+PIvBb7+dU5beKjFCxjSybLKbUP0v6BXSsk\nHFlY5LikQECzSHy/TLCl78v911C9k5Hs1s5vu1vh7ED8u53V7+kgIKsaJ5y9qsPM\nne0WMuTCfJk1Vp1lL/AndOPXmINuJLaQpPtmQWCJT5PpEME9yUt93WOL8S1vVXww\n70+0pervJ1P0YO+8t4y/6SitZORaUoxTb66HkBQoQQKBgQDyMx3JyyzVYXueJi+A\nG035euIuSgcLQK6FODkTaZR3s8dknh4KMHK7f2BBwS50XObxR8gZi+hRFlPSwE7z\nOx/nF8iKZVOWu1TxP1rOHYygxIUoBWhtoAEdemY3Ktm+kxo/+TXLJv6FyzJkTpfL\nB76ENxKOM/JRoN4kHk81g4CsrQKBgQDeK3EfKmysn2IA7lgn1qcJYKTi5gmmXMGT\nC1+XRTJ+x0y/yy7qlF3dQp6DC0u75/n/zOinNfi8ji/6E5BdNrS0QRVPYeXDnqDI\n6bp+reSPAnwKJT60ouHsSt6HODSO/qNJT7ayWEJ5+hNy942CU4kGDEUBmHlFMWlF\n6hh39hXEIQKBgQCsytMhuJZP1bB/7/ZLiy9iIc1kAORtnsPjv2zY8KY/kD9dBYGg\n+1efdQyTXONrmSwaT3/u2eXwk+FRpmmtFi14jXtBYXD1RMkhJHYAPwypVgs5tkH+\nk/y3ry9lhGi8ke5UXdOHEFbd1U4qSff5nZjKcxAF7AGhQwe49PbF0v/mMQKBgQDH\nsNBarO1FM3UJVTITjNJSkXVjJFTkHVc4be6bruy2GzkW4u/mlTjRGYIUU2DdIqMI\nkwtC0DYkdMEWy+Lkhblik2UuFtZIQBpQvBSOrIpVKGyJSfTUs9rRYnIlpBVJugLW\ncDnMj5wguvAkU/HzhFYTA5A64OuPj9wJpWIc4SmrQQKBgFXuajdb9rWv5IQdA5Lz\n/trpREcPlZCjpCG+ONkx5Ch43TQkpcBeRjSjO+cjlU33YFrXKx6pIE/h5VhGSWZj\n7eTLjsEucU1xzwK/8oXYPW1siyI7mkYZrgwYrhUuHBRfMLLG79ll2wFiPEQmZla/\nvRQk+EWQ6rgRbue4xtamHQ6w\n-----END PRIVATE KEY-----\n",
  "client_email": "appoutside@fluent-observer-386614.iam.gserviceaccount.com",
  "client_id": "118113499396332634851",
  "auth_uri": "https://accounts.google.com/o/oauth2/auth",
  "token_uri": "https://oauth2.googleapis.com/token",
  "auth_provider_x509_cert_url": "https://www.googleapis.com/oauth2/v1/certs",
  "client_x509_cert_url": "https://www.googleapis.com/robot/v1/metadata/x509/appoutside%40fluent-observer-386614.iam.gserviceaccount.com",
  "universe_domain": "googleapis.com"
}
)

pandas_gbq.context.credentials = credentials
pandas_gbq.context.project = "fluent-observer-386614"

In [24]:
# pandas_gbq.to_gbq(df, 'daten.df_pandas', project_id='fluent-observer-386614', if_exists='replace')

# Carregamento de **dados históricos** que estão no banco de dados

## Dados do suíno

In [7]:
# Histórico de dados do suíno
suino_historico = pd.read_gbq('daten.suino_historico_ajustado', project_id='fluent-observer-386614')
suino_historico['Data'] = pd.to_datetime(suino_historico['Data'])  #Ajustando a data
suino_historico["Data"] =  suino_historico['Data'].dt.strftime('%d/%m/%Y')  #Ajustando a data
suino_historico.set_index('Data', inplace = True)
suino_historico.info()
suino_historico.tail()

<class 'pandas.core.frame.DataFrame'>
Index: 3018 entries, 01/07/2010 to 12/05/2023
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   MG      3018 non-null   float64
 1   PR      3018 non-null   float64
 2   RS      3018 non-null   float64
 3   SC      3018 non-null   float64
 4   SP      3017 non-null   float64
dtypes: float64(5)
memory usage: 141.5+ KB

              MG    PR    RS    SC    SP
Data
08/05/2023  6.87  6.10  6.27  6.08  6.78
09/05/2023  6.95  6.28  6.30  6.21  6.87
10/05/2023  6.96  6.36  6.30  6.21  6.87
11/05/2023  6.96  6.38  6.30  6.21  6.87
12/05/2023  6.96  6.38  6.30  6.21  6.84

# Carregamento ds dados web em **tempo real** atualizados

In [26]:
import requests

#A url que você quer acesssar
url = "https://www.cepea.esalq.usp.br/br/indicador/suino.aspx"

#Informações para fingir ser um navegador
header = {
  "User-Agent": "Mozilla/5.0 (X11; Linux x86_64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/50.0.2661.75 Safari/537.36",
  "X-Requested-With": "XMLHttpRequest"
}
#juntamos tudo com a requests
r = requests.get(url, headers=header)
#E finalmente usamos a função read_html do pandas
suino_diario = pd.read_html(r.text, thousands='.', decimal=',')

## Dados do suíno

In [27]:
suino_dia = pd.DataFrame(data = suino_diario[0][['Unnamed: 0','Estado', 'ValorVista']])
suino_dia.rename(columns = {"Unnamed: 0": "Data", "ValorVista": "Valor"}, inplace = True)
suino_dia['Data'] = pd.to_datetime(pd.to_datetime(suino_dia['Data']).dt.date)
suino_dia["Data"] =  suino_dia['Data'].dt.strftime('%m/%d/%Y')
suino_dia.info()
suino_dia.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 15 entries, 0 to 14
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Data    15 non-null     object
 1   Estado  15 non-null     object
 2   Valor   15 non-null     float64
dtypes: float64(1), object(2)
memory usage: 488.0+ bytes

         Data          Estado  Valor
0  12/05/2023      MG - posto   6.96
1  12/05/2023  PR - a retirar   6.38
2  12/05/2023  RS - a retirar   6.30
3  12/05/2023  SC - a retirar   6.21
4  12/05/2023      SP - posto   6.84

In [28]:
# Transformando colunas em linhas
suino_dia = suino_dia.pivot(index='Data', columns='Estado', values='Valor')
suino_dia

Estado,MG - posto,PR - a retirar,RS - a retirar,SC - a retirar,SP - posto
Data,,,,,
10/05/2023,6.96,6.36,6.3,6.21,6.87
11/05/2023,6.96,6.38,6.3,6.21,6.87
12/05/2023,6.96,6.38,6.3,6.21,6.84

In [29]:
# Renomeando as colunas
suino_dia.rename(columns = {'MG - posto': 'MG', 
                            'PR - a retirar': "PR", 
                            'RS - a retirar': 'RS', 
                            'SC - a retirar': 'SC', 
                            'SP - posto': 'SP',
                            'Estado': ''}, inplace = True)

suino_dia.columns.name = ''
suino_dia.index.name = 'Data'

In [30]:
suino_dia

              MG    PR   RS    SC    SP
Data
10/05/2023  6.96  6.36  6.3  6.21  6.87
11/05/2023  6.96  6.38  6.3  6.21  6.87
12/05/2023  6.96  6.38  6.3  6.21  6.84

# **Atualização da base histórica** com as informações do dia

## Dados do suíno

In [31]:
# Dados atuais 
suino_dia

              MG    PR   RS    SC    SP
Data
10/05/2023  6.96  6.36  6.3  6.21  6.87
11/05/2023  6.96  6.38  6.3  6.21  6.87
12/05/2023  6.96  6.38  6.3  6.21  6.84

In [32]:
# Dados históricos
suino_historico.tail(5)

              MG    PR    RS    SC    SP
Data
08/05/2023  6.87  6.10  6.27  6.08  6.78
09/05/2023  6.95  6.28  6.30  6.21  6.87
10/05/2023  6.96  6.36  6.30  6.21  6.87
11/05/2023  6.96  6.38  6.30  6.21  6.87
12/05/2023  6.96  6.38  6.30  6.21  6.84

In [33]:
# Concatenando 
df_suino = pd.concat([suino_dia, suino_historico]).drop_duplicates().reset_index()
df_suino['Data'] = pd.to_datetime(df_suino['Data'], dayfirst = True, format = '%d/%m/%Y')

In [34]:
df_suino.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3018 entries, 0 to 3017
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Data    3018 non-null   datetime64[ns]
 1   MG      3018 non-null   float64
 2   PR      3018 non-null   float64
 3   RS      3018 non-null   float64
 4   SC      3018 non-null   float64
 5   SP      3017 non-null   float64
dtypes: datetime64[ns](1), float64(5)
memory usage: 141.6 KB

In [35]:
# Ajustando a ordem
df_suino.sort_values(by = ['Data'], inplace = True, ignore_index = True)

In [36]:
df_suino.head()

        Data    MG    PR    RS    SC    SP
0 2010-07-01  2.73  2.21  2.21  2.17  2.56
1 2010-07-02  2.76  2.22  2.22  2.19  2.57
2 2010-07-05  2.73  2.22  2.20  2.19  2.58
3 2010-07-06  2.73  2.22  2.23  2.23  2.59
4 2010-07-07  2.73  2.26  2.21  2.23  2.59

In [37]:
df_suino.tail()

           Data    MG    PR    RS    SC    SP
3013 2023-05-08  6.87  6.10  6.27  6.08  6.78
3014 2023-05-09  6.95  6.28  6.30  6.21  6.87
3015 2023-05-10  6.96  6.36  6.30  6.21  6.87
3016 2023-05-11  6.96  6.38  6.30  6.21  6.87
3017 2023-05-12  6.96  6.38  6.30  6.21  6.84

In [38]:
# Padronizando a tabela (transformando colunas em linhas)
'''
pd.melt(df_suino, 
        id_vars = 'Data',
        value_vars = ['MG', 'PR', 'RS', 'SC', 'SP'],
        var_name = 'Estado',
        value_name = 'Valor')
'''

"\npd.melt(df_suino, \n        id_vars = 'Data',\n        value_vars = ['MG', 'PR', 'RS', 'SC', 'SP'],\n        var_name = 'Estado',\n        value_name = 'Valor')\n"

In [39]:
df_suino

           Data    MG    PR    RS    SC    SP
0    2010-07-01  2.73  2.21  2.21  2.17  2.56
1    2010-07-02  2.76  2.22  2.22  2.19  2.57
2    2010-07-05  2.73  2.22  2.20  2.19  2.58
3    2010-07-06  2.73  2.22  2.23  2.23  2.59
4    2010-07-07  2.73  2.26  2.21  2.23  2.59
...         ...   ...   ...   ...   ...   ...
3013 2023-05-08  6.87  6.10  6.27  6.08  6.78
3014 2023-05-09  6.95  6.28  6.30  6.21  6.87
3015 2023-05-10  6.96  6.36  6.30  6.21  6.87
3016 2023-05-11  6.96  6.38  6.30  6.21  6.87
3017 2023-05-12  6.96  6.38  6.30  6.21  6.84

[3018 rows x 6 columns]

# Atualização de tabelas no google big query

## Dados do Suíno

In [40]:
pandas_gbq.to_gbq(df_suino, 'daten.suino_historico_ajustado', project_id='fluent-observer-386614', if_exists='replace')

100%|████████████████████████████████████████████████████████████████████████████████████████████| 1/1 [00:00<?, ?it/s]

In [2]:
import time
time.sleep(5)